config/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0.001;

boundaryField
{
    outlet
    {
        type            calculated;
        value           uniform 0.001;
    }
    propeller
    {
        type            compressible::alphatWallFunction;
        value           uniform 0.001;
    }
    AMI1
    {
        type            cyclicAMI;
        value           uniform 0.001;
    }
    AMI2
    {
        type            cyclicAMI;
        value           uniform 0.001;
    }
}


// ************************************************************************* //
