config/system/function/fieldAverage
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

pMean
{
// Mandatory entries (unmodifiable)
type            fieldAverage;
libs            (fieldFunctionObjects);

// Mandatory entries (runtime modifiable)
fields
(
p
{
        mean        true;
        prime2Mean  false;
        base        time;
        // windowType   exact;
        // window       5000.0;
        // windowName   pMean;
        // allowRestart true;
}
);

// // Optional entries (runtime modifiable)
// restartOnRestart    true;
// restartOnOutput     false;
// periodicRestart     false;
// restartPeriod       0.00002;

// Optional (inherited) entries
enabled         true;
log             true;
timeStart       0.1;
timeEnd         0.12;
executeControl  timeStep;
executeInterval 1;
writeControl    timeStep;
writeInterval   $interval;
}
// ************************************************************************* //
