config/system/function/probes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Fixing the probe the absolute coordinates 
probes
{
        type    probes;
        libs    ("libsampling.so");
        writeControl    timeStep;
        writeInterval   $monitor;
        fields (p);
        probeLocations
        (
                // Suction surface
                (0 0.05975 0.05975) 
                (0 0.0956 0.05975)
                (0 0.11471999999999999 0.05975)
                (0 -0.05975 0.05975) 
                (0 -0.0956 0.05975)
                (0 -0.11471999999999999 0.05975)

                //pressure surface
                (0 0.05975 -0.05975) 
                (0 0.0956 -0.05975)
                (0 0.11471999999999999 -0.05975)
                (0 -0.05975 -0.05975) 
                (0 -0.0956 -0.05975)
                (0 -0.11471999999999999 -0.05975)
        );
        fixedLocations false; 
}

// For fixing the probes to the mesh
probesFixed
{
        type    probes;
        libs    ("libsampling.so");
        writeControl    timeStep;
        writeInterval   $monitor;
        fields (p);
        probeLocations
        (
                // 50% Span
                # (-0.0064743978476818 0.05975 0.0018921112288592383) // 1 mm distance
                # (-0.006139781118886734 0.05975 0.0024016248513960108)
                # (-0.0056409428004367485 0.05975 0.0027734813225736904)
                # (-0.005019367981224683 0.05975 0.003048323786830025)
                # (-0.004288067485926162 0.05975 0.003250632695251239)
                # (-0.0034510039924636566 0.05975 0.0033903356113990832)
                # (-0.002514884766374403 0.05975 0.0034678623076149747)
                # (-0.0015638438463353077 0.05975 0.0034800067272404943)
                # (-0.00038668423747832204 0.05975 0.003422173144794156)
                # (0.0007770265394831844 0.05975 0.003290633617281988)
                # (0.0019854570879847926 0.05975 0.003084120042078011)
                # (0.003222339959890026 0.05975 0.002802429669745537)
                # (0.004465137096131473 0.05975 0.0024517372101892027)
                # (0.005671172684266135 0.05975 0.0020588745206131815)
                # (0.006862099628760653 0.05975 0.001635081088538016)
                # (0.008036833148000614 0.05975 0.0011819533594816948)
                # (0.009183154466730233 0.05975 0.0007064118819680103)
                # (0.010290157421304222 0.05975 0.000216418951392399)
                # (0.011346985549731806 0.05975 -0.00027994379151285455)
                # (0.012343760174506405 0.05975 -0.0007737759094820466)
                # (0.013271899780721916 0.05975 -0.0012562148282931108)
                # (0.014122893493484442 0.05975 -0.0017187516624839196)
                # (0.014889429090746125 0.05975 -0.002152296223089833)
                # (0.015565660811035234 0.05975 -0.0025485365410385474)
                # (0.016145995381237878 0.05975 -0.0028992855964345395)
                # (0.016790554888396394 0.05975 -0.00348956096970061)
                # (0.016715156814458683 0.05975 -0.004425011934288145)
                # (0.014646698393729765 0.05975 -0.004785145561254969)
                # (0.014012903163917163 0.05975 -0.004589888297960722)
                # (0.013285894103922672 0.05975 -0.004371766332202139)
                # (0.012470476133125378 0.05975 -0.004133058992516252)
                # (0.011575821955572186 0.05975 -0.0038780105091348197)
                # (0.010612153938992959 0.05975 -0.0036121054609887467)
                # (0.009589432782200003 0.05975 -0.0033390218533109876)
                # (0.008518833341449438 0.05975 -0.0030630072541707708)
                # (0.007411696909980371 0.05975 -0.002787529737334568)
                # (0.006279669919541031 0.05975 -0.002515075404719313)
                # (0.005134514917369657 0.05975 -0.0022475209900915324)
                # (0.003987626875062857 0.05975 -0.001985519328242283)
                # (0.0028626128077408556 0.05975 -0.0017338330592492814)
                # (0.0017968143168567493 0.05975 -0.001512067620851638)
                # (0.0007631810362432487 0.05975 -0.0013145034790134661)
                # (-0.00023637058059835925 0.05975 -0.0011342463605057505)
                # (-0.0011931792015652852 0.05975 -0.0009660883182853246)
                # (-0.002098533792567975 0.05975 -0.0008050310104196878)
                # (-0.0029457484552861415 0.05975 -0.0006450847467608315)
                # (-0.0037284315339118647 0.05975 -0.0004788699855067337)
                # (-0.004440685275448916 0.05975 -0.0002978249044909365)
                # (-0.005080157187344421 0.05975 -8.839585116375906e-05)
                # (-0.005643509565466347 0.05975 0.00017166636564011227)
                # (-0.006118133427801686 0.05975 0.0005196158542992272)
                # (-0.006457008396952075 0.05975 0.0010058893307518305)


                # // 80% Span
                # (-0.004669372152996881 0.0956 0.001061661083778244) // 1 mm distance
                # (-0.004438662918785314 0.0956 0.0015072827991436401)
                # (-0.004092179621225964 0.0956 0.0018320423143646015)
                # (-0.0036609566319190084 0.0956 0.0020822025609017114)
                # (-0.003153932099009424 0.0956 0.0022795063325208973)
                # (-0.0025731688491628783 0.0956 0.002432979983560783)
                # (-0.0019226738257957909 0.0956 0.002543443856674474)
                # (-0.0012086229101418253 0.0956 0.002608438513100343)
                # (-0.0004843713478150034 0.0956 0.002624160746755385)
                # (0.0003729803724337675 0.0956 0.002587295757874645)
                # (0.0012168565502593055 0.0956 0.0024965936090000215)
                # (0.0020802518362092555 0.0956 0.002351886991450278)
                # (0.0029444115004276634 0.0956 0.0021583711030222965)
                # (0.0037767054171151063 0.0956 0.001935609313194659)
                # (0.004594224433768068 0.0956 0.0016926034871510964)
                # (0.005400364961279354 0.0956 0.0014290975246319887)
                # (0.00618715705191129 0.0956 0.0011493199418283026)
                # (0.006947275478704205 0.0956 0.0008582916548522103)
                # (0.007673431431591285 0.0956 0.0005610635838748187)
                # (0.008358766057424144 0.0956 0.00026338127857549105)
                # (0.008997492581982557 0.0956 -2.917516593255046e-05)
                # (0.009583768344899182 0.0956 -0.0003112052311470823)
                # (0.01011236003656815 0.0956 -0.0005767428517480162)
                # (0.010579124834243243 0.0956 -0.000820376464647984)
                # (0.010980104534008892 0.0956 -0.0010367983394644117)
                # (0.011545926312514474 0.0956 -0.0016606076040164503)
                # (0.011506432426886187 0.0956 -0.002316864125503745)
                # (0.009691893194163052 0.0956 -0.002895116236879898)
                # (0.009268863479520382 0.0956 -0.0027914199186414284)
                # (0.008785981696482249 0.0956 -0.002677264529535196)
                # (0.008244640194809642 0.0956 -0.0025531779277277256)
                # (0.007651195775741971 0.0956 -0.0024216626518627302)
                # (0.007012542271254103 0.0956 -0.0022859305362945364)
                # (0.006334996898988292 0.0956 -0.002147879122658144)
                # (0.005626065741550954 0.0956 -0.002009879572399668)
                # (0.004893008676994844 0.0956 -0.0018736779006730034)
                # (0.004143248781103888 0.0956 -0.0017403689205373486)
                # (0.0033842327579067456 0.0956 -0.0016106436143241336)
                # (0.0026230113824256347 0.0956 -0.0014843700830936594)
                # (0.001879347938014701 0.0956 -0.001364720226836975)
                # (0.0011808442751235922 0.0956 -0.0012636174898449566)
                # (0.0005043865927280746 0.0956 -0.0011771098445287008)
                # (-0.00015271190852227405 0.0956 -0.0010999717097161725)
                # (-0.0007857711115841914 0.0956 -0.0010284280573315003)
                # (-0.001389942670408329 0.0956 -0.0009587186497241315)
                # (-0.001962531558032366 0.0956 -0.0008861317178229552)
                # (-0.0025014357917251115 0.0956 -0.0008044546876069966)
                # (-0.003005559888577792 0.0956 -0.0007055300237904145)
                # (-0.0034773848346826364 0.0956 -0.0005754300352311811)
                # (-0.0039182459957280025 0.0956 -0.00038946631702585467)
                # (-0.004315947365786388 0.0956 -0.00010660669911989888)
                # (-0.004615074351612975 0.0956 0.00031664915620425337)


                # // 96% span
                # (-0.003910704718454967 0.11471999999999999 0.0007650116809343833) // 1mm distance 
                # (-0.00372017755734389 0.11471999999999999 0.0011818713533053395)
                # (-0.0034343530799341845 0.11471999999999999 0.001481186008963391)
                # (-0.0030806021232730628 0.11471999999999999 0.0017135768339101988)
                # (-0.002666022000130949 0.11471999999999999 0.0019004649635181259)
                # (-0.002191625571711594 0.11471999999999999 0.0020508942591791457)
                # (-0.001660070760373556 0.11471999999999999 0.002166077853805713)
                # (-0.001075926409830477 0.11471999999999999 0.002243999447352656)
                # (-0.00044588391934738495 0.11471999999999999 0.002281238521675024)
                # (0.0002202608585294962 0.11471999999999999 0.002274611479421476)
                # (0.0009122867755738715 0.11471999999999999 0.0022228005228541446)
                # (0.0016200440773895006 0.11471999999999999 0.002125603541837845)
                # (0.002326114727612538 0.11471999999999999 0.0019877154967372457)
                # (0.0030018428417954695 0.11471999999999999 0.001825856674198273)
                # (0.0036624662050909846 0.11471999999999999 0.0016480897642217266)
                # (0.004313353717926063 0.11471999999999999 0.001453643962849931)
                # (0.004948339034420672 0.11471999999999999 0.0012457603953211888)
                # (0.005561638391050363 0.11471999999999999 0.0010283393630551238)
                # (0.006147508174306561 0.11471999999999999 0.0008052705047599054)
                # (0.006700411470530659 0.11471999999999999 0.0005810643246054976)
                # (0.007215810171113024 0.11471999999999999 0.0003600036325980305)
                # (0.007689049622757218 0.11471999999999999 0.00014625873653049276)
                # (0.008115838913125464 0.11471999999999999 -5.5461280623658564e-05)
                # (0.008492823575090796 0.11471999999999999 -0.00024091971793801972)
                # (0.008816807026223972 0.11471999999999999 -0.00040597816730747124)
                # (0.009350504275309517 0.11471999999999999 -0.0010526506848461802)
                # (0.00932371974860509 0.11471999999999999 -0.0015880744367133364)
                # (0.007628851320116208 0.11471999999999999 -0.0022554147350444757)
                # (0.007294446300967287 0.11471999999999999 -0.0021838218213185595)
                # (0.006914211482109303 0.11471999999999999 -0.002105905450491494)
                # (0.006488033950693486 0.11471999999999999 -0.0020216054928397947)
                # (0.00602107210587409 0.11471999999999999 -0.0019327689970803984)
                # (0.005518788844572748 0.11471999999999999 -0.001841748289427431)
                # (0.00498595141965052 0.11471999999999999 -0.0017498115484879868)
                # (0.004428513176552047 0.11471999999999999 -0.0016586504499028387)
                # (0.0038520125434485662 0.11471999999999999 -0.0015694210214968222)
                # (0.0032621072259126933 0.11471999999999999 -0.0014827743220405993)
                # (0.002664449569233563 0.11471999999999999 -0.001399049527692033)
                # (0.002064297850909917 0.11471999999999999 -0.0013179382494875633)
                # (0.001479866764751918 0.11471999999999999 -0.0012419263018984693)
                # (0.0009345572783976677 0.11471999999999999 -0.001179902762741942)
                # (0.0004068267104993423 0.11471999999999999 -0.0011287103469791865)
                # (-0.00010783550019872963 0.11471999999999999 -0.001084112736607418)
                # (-0.0006062928589176243 0.11471999999999999 -0.0010431041132873578)
                # (-0.0010852148931296821 0.11471999999999999 -0.001002600289461867)
                # (-0.0015435086154101188 0.11471999999999999 -0.0009586123879952777)
                # (-0.0019808601393227383 0.11471999999999999 -0.0009056174839036764)
                # (-0.002398308034783181 0.11471999999999999 -0.0008358253029655473)
                # (-0.002800701786230903 0.11471999999999999 -0.0007352499473985763)
                # (-0.0031919110018928647 0.11471999999999999 -0.000577879322416569)
                # (-0.00356003252369608 0.11471999999999999 -0.00031999591208247926)
                # (-0.0038442960815885286 0.11471999999999999 7.980028704905102e-05)


        );
        fixedLocations true;
}

// ************************************************************************* //
