config/system/function/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

surfaces
{
    type            surfaces;
    libs            (sampling);
    writeControl    timeStep;
    writeInterval   $interval;
    executeControl      timeStep;
    executeInterval     $interval;

    surfaceFormat   vtk;
    fields          (p U); 

    sampleScheme    cell;

    // interpolationScheme cellPoint;  //<- default

    surfaces
    {
        // zNormal
        // {
        //     type            cuttingPlane;
        //     planeType       pointAndNormal;
        //     pointAndNormalDict
        //     {
        //         point   (0 0 0);
        //         normal  (0 0 1);
        //     }
        //     interpolate     true;
        // }

        // isoQ
        // {
        //     type            isoSurface;
        //     isoField        Q;
        //     isoValue        1000;
        //     interpolate     true;
        // }

        // propeller
        // {
        //     type            patch;
        //     patches         ("propeller.*");
        //     interpolate     true;
        //     invariant       true;  // Unaffected by mesh motion
        //     surfaceFormat   ensight;
        // }
        propeller
        {
            type            patch;
            patches         (propeller);
            interpolate     true;
            invariant       true;  // Unaffected by mesh motion
            surfaceFormat   ensight;
        }
    }
}


// ************************************************************************* //
