config/system/function/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

vorticity
{
        type        vorticity;
        libs        (fieldFunctionObjects);
        executeControl  timeStep;
        executeInterval $interval;
        writeControl    timeStep;
        writeInterval   $interval;
}
// ************************************************************************* //
