config/system/function/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

yPlus
{
    // Mandatory entries (unmodifiable)
    type            yPlus;
    libs            (fieldFunctionObjects);

    // // Optional (inherited) entries
    // writePrecision  8;
    // writeToFile     true;
    // useUserTime     true;
    // region          region0;
    // enabled         true;
    log             true;
    // timeStart       0;
    // // timeEnd         endTime;
    executeControl  timeStep;
    executeInterval $interval;
    writeControl    timeStep;
    writeInterval   $interval;
}


// ************************************************************************* //
