config/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|pcorr)"
    {
        solver          PCG;
        preconditioner  diagonal;
        tolerance       1e-8;
        //relTol          0.001;
    }

    "(p|pcorr)Final"
    {
        $p;
        //relTol          0;
    }

    "(rho|U|k|omega|e)"
    {
        solver          PBiCGStab;
        preconditioner  diagonal;
        tolerance       1e-9;
        //relTol          0.001;
    }

    "(rho|U|k|omega|e)Final"
    {
        $U;
        //relTol          0;
    }

    cellDisplacement
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
    }
}

SIMPLE
{
    residualControl
    {
        p               1e-4;
        U               1e-4;
        "(k|omega|e)"   1e-4;
    }

    nNonOrthogonalCorrectors 0;
    // pMinFactor      0.1;
    // pMaxFactor      2;
}

PIMPLE
{
    nCorrectors              5;
    nNonOrthogonalCorrectors 1;
    nOuterCorrectors         3;
    // pMinFactor      0.1;
    // pMaxFactor      2;
}

relaxationFactors
{
    equations
    {
        ".*"     1;
    }
}


// ************************************************************************* //
