config/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

AMI.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
    // Write features to obj format for postprocessing
    //writeObj            yes;
}
propeller.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
    
    // Write features to obj format for postprocessing
    //writeObj            yes;
}
// outlet.stl
// {
//     extractionMethod    extractFromSurface;
//     includedAngle       150;
// }

// ************************************************************************* //
